In [1]:
import pandas as pd

In [2]:
data_a = {'id': [1,2,3],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']
         }
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

In [3]:
data_b = {'id': [4,5,6],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']
         }
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

In [4]:
dataframe_a

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali

In [5]:
dataframe_b

   id  first     last
0   4  Billy   Bonder
1   5  Brian    Black
2   6   Bran  Balwner

In [6]:
pd.concat([dataframe_a, dataframe_b], axis = 0)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
0   4  Billy    Bonder
1   5  Brian     Black
2   6   Bran   Balwner

In [7]:
pd.concat([dataframe_a, dataframe_b], axis = 1)

   id  first      last  id  first     last
0   1   Alex  Anderson   4  Billy   Bonder
1   2    Amy  Ackerman   5  Brian    Black
2   3  Allen       Ali   6   Bran  Balwner

# Merge

In [9]:
employee_data = {
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']
}
dataframe_employees =  pd.DataFrame(employee_data, columns = ['employee_id', 'name'])

In [10]:
sales_data = {
    'employee_id': ['3', '4', '5', '6'],
    'total_sales': [23456, 2512, 2345, 1455]
}
dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

In [11]:
dataframe_employees

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tim Horton

In [12]:
dataframe_sales

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

In [15]:
# By default uses inner join
pd.merge(dataframe_employees, dataframe_sales, on = ['employee_id'])

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [18]:
# Now using outer join
pd.merge(dataframe_employees, dataframe_sales, how = 'outer', on = ['employee_id'])

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [19]:
# By default uses inner join
pd.merge(dataframe_employees, dataframe_sales, left_on = ['employee_id'], right_on = ['employee_id'])

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512